4.2a: Selecting data in a Dataframe

In [1]:
import pandas as pd

In [4]:
dict = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

df = pd.DataFrame(dict)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [5]:
col = df[["ID"]]
col

   ID
0   1
1   2
2   3
3   4

In [6]:
type(col)

pandas.core.frame.DataFrame

In [11]:
dsi = df[["Department", "Salary", "ID"]]
dsi

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [12]:
coursesDF = pd.DataFrame({"Student": ["David", "Samuel", "Terry", "Evan"],
                           "Age": [27, 24, 22, 32],
                           "Country": ["UK", "Canada", "China", "USA"],
                           "Course": ["Python", "Data Structures", "Machine Learning", "Web Development"],
                           "Marks": [85, 72, 89, 76]})
coursesDF

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [18]:
b = coursesDF[["Marks"]]
b

   Marks
0     85
1     72
2     89
3     76

In [20]:
c = coursesDF[["Country", "Course"]]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [26]:
coursesDF["Student"]

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [51]:
coursesDF.iloc[0, 0]

'David'

In [52]:
coursesDF.iloc[0, 2]

'UK'

In [57]:
df2 = df.set_index("Name")
df2

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [56]:
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [58]:
df2.loc["Jane", "Salary"]

50000

In [59]:
df2.loc["Jane", "Department"]

'Design Team'

In [60]:
df2.iloc[3, 2]

60000

In [103]:
df.iloc[:2, :3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [104]:
df.loc[:2, "ID":"Department"]

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [105]:
df2.loc["Rose":"Jane", "ID":"Department"]

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

In [107]:
df.loc[2:3, "Name":"Department"]

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure